Revit 2027 API
ParameterTypeId.SurfacePatternIdParam Property
 "Surface fill pattern"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SurfacePatternIdParam { get; }
Public Shared ReadOnly Property SurfacePatternIdParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SurfacePatternIdParam {
	ForgeTypeId^ get ();
}
static member SurfacePatternIdParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace